teverett/cthugha-esp/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

# CPU
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_400=y

# PSRAM - needed for LCD framebuffers
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# LCD
CONFIG_ESP_LCD_RGB_ISR_IRAM_SAFE=y

# Stack sizes for our tasks
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Partition table
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
